TOKEN = '5821638217:AAGkeYEvsWlltgbarkYnLlfivJSWURYkI-c' # token from @BotFather

REPLY_LIST = ['😍да', '😒нет', '😲галя, у нас отмена', '🤩отмена комиссии']

INLINE_LIST = {'ЗАЕБИСЕЧНО' : 'excellent',
               'ПИЗДЕЦ' : 'fuck'}

WORDS = ('Один', 'Два', 'Три', 'Четыре', 'Пять', 'Жопа')

QUESTION = "Напиши перевод на английском слова {0}"

RULE_ANSWERS = {"one" : "Один",
                "two" : "Два",
                "three" : "Три",
                "four" : "Четыре",
                "five" : "Пять"}
                